# Data Preprocessing

In [226]:
import pandas as pd

In [227]:
df = pd.read_csv("training.csv", delimiter=";", dtype={'variable2':str, 'variable8':str})
df.shape

(3700, 19)

In [228]:
df.head()

,variable1,variable2,variable3,variable4,variable5,variable6,variable7,variable8,variable9,variable10,variable11,variable12,variable13,variable14,variable15,variable17,variable18,variable19,classLabel
0,a,"17,92","5,4e-05",u,g,c,v,"1,75",f,t,1,t,g,80.0,5,800000.0,t,0,no.
1,b,"16,92","3,35e-05",y,p,k,v,"0,29",f,f,0,f,s,200.0,0,2000000.0,NaN,0,no.
2,b,"31,25","0,0001125",u,g,ff,ff,0,f,t,1,f,g,96.0,19,960000.0,t,0,no.
3,a,"48,17","0,0001335",u,g,i,o,"0,335",f,f,0,f,g,0.0,120,0.0,NaN,0,no.
4,b,"32,33","0,00035",u,g,k,v,"0,5",f,f,0,t,g,232.0,0,2320000.0,f,0,no.

## Checking NA Values

1. number of NA values in columns shows there might be a significant correlation between some columns
2. 58% of var18 values are NA, var18 to be dropped

In [229]:
na_columns = df.columns[df.isna().any()].tolist()
df[na_columns].isna().sum()

variable1       39
variable2       39
variable4       64
variable5       64
variable6       66
variable7       66
variable14     100
variable17     100
variable18    2145
dtype: int64

None of the rows that have var1 as NA has var2 as NA, relationship to be reviewed

In [230]:
variable1_na_indices = df['variable1'][df['variable1'].isna()].index.tolist()
variable2_na_indices = df['variable2'][df['variable2'].isna()].index.tolist()
variable1_na_indices == variable2_na_indices

False

In [231]:
variable1_na_indices = set(variable1_na_indices)
variable2_na_indices = set(variable2_na_indices)
intersection = variable1_na_indices.intersection(variable2_na_indices)
len(intersection)

0

All rows that have var4 as NA have var5 as NA

In [232]:
variable4_na_indices = df['variable4'][df['variable4'].isna()].index.tolist()
variable5_na_indices = df['variable5'][df['variable5'].isna()].index.tolist()
variable4_na_indices == variable5_na_indices

True

All rows that have var6 as NA have var7 as NA

In [233]:
variable6_na_indices = df['variable6'][df['variable6'].isna()].index.tolist()
variable7_na_indices = df['variable7'][df['variable7'].isna()].index.tolist()
variable6_na_indices == variable7_na_indices

True

All rows that have var14 as NA have var17 as NA

In [234]:
variable14_na_indices = df['variable14'][df['variable14'].isna()].index.tolist()
variable17_na_indices = df['variable17'][df['variable17'].isna()].index.tolist()
variable14_na_indices == variable17_na_indices

True

## Looking for Relationships

no apparent relationship between var1 and var2

In [235]:
df[['variable1', 'variable2']].head()

  variable1 variable2
0         a     17,92
1         b     16,92
2         b     31,25
3         a     48,17
4         b     32,33

100% correlation between var4 and var5, var5 to be dropped

In [236]:
df[['variable4', 'variable5']].head()

  variable4 variable5
0         u         g
1         y         p
2         u         g
3         u         g
4         u         g

In [237]:
print(df['variable4'].unique())
print(df['variable5'].unique())

['u' 'y' nan 'l']
['g' 'p' nan 'gg']

In [238]:
print(df['variable4'][df['variable4']=='u'].index.tolist() == df['variable5'][df['variable5']=='g'].index.tolist())
print(df['variable4'][df['variable4']=='y'].index.tolist() == df['variable5'][df['variable5']=='p'].index.tolist())
print(df['variable4'][df['variable4']=='l'].index.tolist() == df['variable5'][df['variable5']=='gg'].index.tolist())

True
True
True

no apparent relationship between var6 and var7

In [239]:
df[['variable6', 'variable7']].head()

  variable6 variable7
0         c         v
1         k         v
2        ff        ff
3         i         o
4         k         v

100% correlation between var14 and var17, var17 to be dropped

In [240]:
df[['variable14', 'variable17']].head()

   variable14  variable17
0        80.0    800000.0
1       200.0   2000000.0
2        96.0    960000.0
3         0.0         0.0
4       232.0   2320000.0

In [241]:
sum(df['variable17'] == df['variable14'] * 10000.0)

3600

In [242]:
df[['variable14','variable17']][df['variable17'] != df['variable14'] * 10000.0].isna().all()

variable14    True
variable17    True
dtype: bool

### Insights so far
> 1. 58% of var18 values are *NA*, var18 to be dropped
> 2. 100% correlation between var4 and var5, var5 to be dropped
> 3. 100% correlation between var14 and var17, var17 to be dropped

## Looking for More Relationships

In [243]:
df.head()

,variable1,variable2,variable3,variable4,variable5,variable6,variable7,variable8,variable9,variable10,variable11,variable12,variable13,variable14,variable15,variable17,variable18,variable19,classLabel
0,a,"17,92","5,4e-05",u,g,c,v,"1,75",f,t,1,t,g,80.0,5,800000.0,t,0,no.
1,b,"16,92","3,35e-05",y,p,k,v,"0,29",f,f,0,f,s,200.0,0,2000000.0,NaN,0,no.
2,b,"31,25","0,0001125",u,g,ff,ff,0,f,t,1,f,g,96.0,19,960000.0,t,0,no.
3,a,"48,17","0,0001335",u,g,i,o,"0,335",f,f,0,f,g,0.0,120,0.0,NaN,0,no.
4,b,"32,33","0,00035",u,g,k,v,"0,5",f,f,0,t,g,232.0,0,2320000.0,f,0,no.

All rows that have var10 as f have var11 as 0, when var10 is true, var11 is a positive integer, var10 to be dropped

In [244]:
df[['variable10', 'variable11']].head()

  variable10  variable11
0          t           1
1          f           0
2          t           1
3          f           0
4          f           0

In [245]:
variable10_f_indices = df['variable10'][df['variable10']=='f'].index.tolist()
variable11_0_indices = df['variable11'][df['variable11']==0].index.tolist()
variable10_f_indices == variable11_0_indices

True

### Insights so far
> 1. 58% of var18 values are *NA*, var18 to be dropped
> 2. 100% correlation between var4 and var5, var5 to be dropped
> 3. 100% correlation between var14 and var17, var17 to be dropped
> 4. All rows that have var10 as *f* have var11 as *0*, when var10 is *t*, var11 is a positive integer, var10 to be dropped

In [246]:
df = df.drop(columns=['variable5', 'variable10', 'variable17', 'variable18'])

## Dealing with NAs

In [247]:
#cols with NAs: var1: D, var2: C, var4: D, var6: D, var7: D, var14: C; D -> Discrete, C -> Continuous

NA values in variable1 are filled with the value 'c'

In [248]:
df['variable1'].unique()

array(['a', 'b', nan], dtype=object)

In [249]:
df['variable1'] = df['variable1'].fillna('c')

NA values in variable4 are filled with the value 'l'

In [250]:
df['variable4'].unique()

array(['u', 'y', nan, 'l'], dtype=object)

In [251]:
df['variable4'] = df['variable4'].fillna('w')

NA values in variable6 are filled with the value 'h'

In [252]:
df['variable6'].unique()

array(['c', 'k', 'ff', 'i', 'j', 'q', 'W', 'd', 'm', 'cc', 'aa', 'r', 'x',
       'e', nan], dtype=object)

In [253]:
df['variable6'] = df['variable6'].fillna('h')

NA values in variable7 are filled with the value 'c'

In [254]:
df['variable7'].unique()

array(['v', 'ff', 'o', 'h', 'j', 'bb', 'n', 'z', nan, 'dd'], dtype=object)

In [255]:
df['variable7'] = df['variable7'].fillna('c')

1. variable2 and variable14 columns are type-casted to float
2. records with NA values in variable2 and variable14 are removed

In [256]:
def reformat(x):
    return x.replace(",", ".")

In [257]:
df['variable2'] = df['variable2'].astype(str)
df['variable2'] = df['variable2'].apply(reformat)
df['variable2'] = df['variable2'].astype(float)

In [258]:
df['variable14'] = df['variable14'].astype(str)
df['variable14'] = df['variable14'].apply(reformat)
df['variable14'] = df['variable14'].astype(float)

In [259]:
na_columns = df.columns[df.isna().any()].tolist()
df[na_columns].isna().sum()

variable2      39
variable14    100
dtype: int64

In [262]:
df = df.dropna()
df.shape

(3562, 15)

In [263]:
df.head()

,variable1,variable2,variable3,variable4,variable6,variable7,variable8,variable9,variable11,variable12,variable13,variable14,variable15,variable19,classLabel
0,a,17.92,"5,4e-05",u,c,v,"1,75",f,1,t,g,80.0,5,0,no.
1,b,16.92,"3,35e-05",y,k,v,"0,29",f,0,f,s,200.0,0,0,no.
2,b,31.25,"0,0001125",u,ff,ff,0,f,1,f,g,96.0,19,0,no.
3,a,48.17,"0,0001335",u,i,o,"0,335",f,0,f,g,0.0,120,0,no.
4,b,32.33,"0,00035",u,k,v,"0,5",f,0,t,g,232.0,0,0,no.